Sail2D/Runs/first_flatplate_75_4/case/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    wings
    {
        type            wall;
        physicalType    wall;
        inGroups        1(wall);
        nFaces          150;
        startFace       13319;
    }
    outlet
    {
        type            patch;
        physicalType    patch;
        nFaces          20;
        startFace       13469;
    }
    tunnel
    {
        type            wall;
        physicalType    wall;
        inGroups        1(wall);
        nFaces          40;
        startFace       13489;
    }
    inlet
    {
        type            patch;
        physicalType    patch;
        nFaces          20;
        startFace       13529;
    }
    defaultFaces
    {
        type            empty;
        inGroups        1(empty);
        nFaces          13434;
        startFace       13549;
    }
)

// ************************************************************************* //
